**APPROACH**

The approach was pretty straightforward. First the data was studied to note what it contained. Since the dataset was small, it was uploaded to a Google Drive and this drive was mounted. Then pandas was used to read the file. The the program asked the user to enter country codes and the dataset was filtered between these country codes using the "loc" command in Python. Then a sorted a list was printed as a final answer.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data=pd.read_csv('/content/drive/MyDrive/Datasets/CountryCodes/data_csv.csv')
data.head()

          Name Code
0      Ecuador   EC
1   Bangladesh   BD
2   Madagascar   MG
3  Saint Lucia   LC
4        Spain   ES

In [ ]:
CC1=input("Enter country code 1:")
CC2=input("Enter country code 2:")

Enter country code 1:IN
Enter country code 2:US

In [ ]:
Countries=data.loc[(data['Code']>CC1) & (data['Code']<CC2)]
Countries.sort_values('Name')

                                     Name Code
21         British Indian Ocean Territory   IO
18                               Cambodia   KH
135                        Cayman Islands   KY
91                                   Chad   TD
136                               Comoros   KM
..                                    ...  ...
247              Turks and Caicos Islands   TC
16                                 Tuvalu   TV
89                                 Uganda   UG
160                               Ukraine   UA
177  United States Minor Outlying Islands   UM

[126 rows x 2 columns]